basic_data = [
  {
  "기차표 왕복" : 80000,
  "카츠멘숀 삿포로라멘 미니안심세트" : 14500,
  "소곱창고기국" : 10000,
  "합천국밥" : 10000,
  "버거킹 롱치킨 버거 세트"  : 5500,
  "숙박비스테이미도" : 55000,
  "굿즈" : 300000,
  "피시방" : 5000,
  "노래방" : 8000,
  "오락실 태고의 달인"  : 3000,
  "오락실 유비트" : 3000,
  "오락실 노스텔지어" : 3000,
  "오락실 팝픈뮤직" : 1000,
  "교통비" : 30000,
  "지스타 입장표값 BTC" : 15000
},
  {
    "여행지": "영국 런던",
    "여행 기간": "12박 14일",
    "총 여행 비용": 4850000,
    "비행기 값 (왕복)": 1000000,
    "식비": 1500000,
    "호텔": 1000000,
    "교통비": 300000,
    "관광비": 1000000,
    "기타 비용 (핸드폰 유심칩 등)": 50000

},
  {
    "숙소": {
        "이름": "코트야드 메리어트",
        "가격": 213000, 
        "박수": 2
    },
    "여행 경비": {
        "교통비": {
            "버스": 1500, 
            "기차": 9600,  
            "이동 횟수": 8
        },
        "기타": 50000 
    },
    "음식": {
        "갈비": 69000, 
        "갈비 횟수": 6, 
        "아이스크림": 10000,  
        "아이스크림 횟수": 3  
    }
},
{
  "로밍" : 50000,
  "자동차 기름 값" : 50000,
  "휴게소 핫도그" : 5000,
  "비행기 값" : 800000,
  "호텔까지 택시" : 20000,
  "호텔비" : 160000,
  "세부 시장" : 70000,
  "저녁" : 60000,
  "간식" : 20000,
  "아점" : 50000,
  "기념품" : 60000,
  "공항까지 택시" : 20000,
},
{
  "to_airport" : 4600,
  "to_osaka" : 411994,
  "JR_pass" : 500000,
  "carrier_bag" : 35000,
  "dinning" : 200000,
  "hotel_per_day" : 83723,
  "exchange_fee" : 9.38,
  "pocket_money" : 200000,
  "roaming" : 30000
},
{
    "여행지": "제주도",
    "기간": 3,
    "식비": 225000,
    "교통비": 120000,
    "숙박비": 360000,
    "기타 비용": 50000
},
{
    "여행 세면 킷": 8000,
    "대전역까지":1500,
    "당일 점심": 8000,
    "대전역에서 청주 공항까지": 10000,
    "청주 공항 -> 오사카": 53000,
    "오사카 -> 나라현": 20500,
    "입장료": 5000,
    "기념품": 10000,
    "사슴 전병": 2000,
    "점심": 8000,
    "저녁": 8000,
    "숙박비": 70000,
    "간식": 4000,
    "해외 데이터 로밍": 2000,
    "환전 수수료": 20000,
    "여행자 보험": 30000,
    "나라현 -> 오사카": 3000,
    "오사카 -> 청주 공항": 53000
},
{
        "lunch":9000, 
        "amusement park ticket": 30000  ,
        "snacks": 8000,
        "drinks": 4000,
        "dinner": 14000,
        "round-train ticket": 64000,
        "room": 60000,
        "bus ticket": 6000
},
{
    "대전역까지 버스 비용 왕복": 3000,
    "대전역에서 광명역까지 기차 왕복": 42400,
    "광명역에서 인천공항까지 리무진 버스 왕복": 24000,
    "인천공항에서 취리히까지 항공편": 3998800,
    "취리히에서 인천공항으로 항공편": 3994100,
    "차량 7일 렌트 비용": 561004,
    "상황에 따라 쓸 돈": 10000000
},
{
    "bus": 54000,
    "flight": 1017800,
    "hotel": 600000,
    "day_1": {
        "title" : "프라하 주요 관광지 탐방",
        "프라하성 입장비": 37000,
        "블타바 강": 0,
        "까를교": 0, 
        "성 니콜라스 교회": 5000, 
        "경비": 70000,
    },
    "day_2": {
        "title" : "프라하 구 시가지 탐방",
        "중세 지하 탐험": 36000,
        "구 시청사": 0,
        "틴 성당": 0, 
        "화약탑": 12000,
        "경비": 70000  
    
    },
    "day_3": {
        "title" : "카를로비 바리 여행",
        "카를로비 바리 교통비": 35000,
        "믈린스카 콜로나다": 29000,
        "푸니 콜라": 18000,
        "길거리 경비": 82000
    },
    "day_4": {
        "title" : "마무리",
        "하벨 시장": 70000
    }
},
{
    "제주도": {
        "거리": 470, 
        "환율": {"10kg귤": 8058}, 
        "숙박비용": {
            "1박_호텔": 120000, 
            "1박_게스트하우스": 50000, 
        },
        "음식비용": {
            "점심_한끼": 12000, 
            "저녁_한끼": 20000, 
        },
        "기타비용": {
            "관광지_입장료": 15000, 
            "교통비": 10000, 
        },
    },
    "도쿄": {
        "거리": 1104.22, 
        "환율": {"1엔": 9.38}, 
        "숙박비용": {
            "1박_호텔": 150000,  
            "1박_게스트하우스": 70000, 
        },
        "음식비용": {
            "점심_한끼": 15000,
            "저녁_한끼": 25000,
        },
        "기타비용": {
            "관광지_입장료": 20000, 
            "교통비": 15000,  
        },
    },
    "그리스": {
        "거리": 8681,
        "환율": {"1유로": 1483.39},
        "숙박비용": {
            "1박_호텔": 200000,  
            "1박_게스트하우스": 100000,
        },
        "음식비용": {
            "점심_한끼": 18000,
            "저녁_한끼": 30000,
        },
        "기타비용": {
            "관광지_입장료": 25000,
            "교통비": 100000,
        },
    },
    "강원도": {
        "거리": 183,  
        "환율": {"10kg감자": 45000},
        "숙박비용": {
            "1박_호텔": 100000,  
            "1박_게스트하우스": 60000,  
        },
        "음식비용": {
            "점심_한끼": 10000,  
            "저녁_한끼": 18000, 
        },
        "기타비용": {
            "관광지_입장료": 10000, 
            "교통비": 8000,  
        },
    },
},
{
    "교통비" : {
        "가는 경비" : 313988.44,
        "오는 경비" : 313988.44,
    },
    "활동비" : {
        "유니버셜 티켓" : 120025,
        "지팡이" : 75400,
        "교복" : 204000,
    },
    "식비" : {
        "버터맥주" : 8000,
        "젤리" : 25060
        }
},
{
  "버스" : 3000,
  "srt" : 35200,
  "라이온즈 파크 파티플로우석 티켓" : 55000,
  "대구 수성 더 아르코 호텔 라이온즈파크점" : 80000,
} 
]